from django.db import models


class CountryDeclarant(models.IntegerChoices):
    NOT_REGISTERED = -1, "Не зареєстрований"
    UKRAINE = 1, "Україна"
    AUSTRALIA = 2, "Австралія"
    AUSTRIA = 3, "Австрія"
    AZERBAIJAN = 4, "Азербайджан"
    ALAND_ISLANDS = 5, "Аландські острови"
    ALBANIA = 6, "Албанія"
    ALGERIA = 7, "Алжир"
    AMERICAN_SAMOA = 8, "Американське Самоа"
    AMERICAN_VIRGIN_ISLANDS = 9, "Американські Віргінські острови"
    ANGUILLA = 10, "Ангілья"
    ANGOLA = 11, "Ангола"
    ANDORRA = 12, "Андорра"
    ANTARCTICA = 13, "Антарктида"
    ANTIGUA_AND_BARBUDA = 14, "Антигуа і Барбуда"
    ARGENTINA = 15, "Аргентина"
    ARUBA = 16, "Аруба"
    AFGHANISTAN = 17, "Афганістан"
    BAHAMAS = 18, "Багамські Острови"
    BANGLADESH = 19, "Бангладеш"
    BARBADOS = 20, "Барбадос"
    BAHRAIN = 21, "Бахрейн"
    BELIZE = 22, "Беліз"
    BELGIUM = 23, "Бельгія"
    BENIN = 24, "Бенін"
    BERMUDA = 25, "Бермудські острови"
    BELARUS = 26, "Білорусь"
    BULGARIA = 27, "Болгарія"
    BOLIVIA = 28, "Болівія"
    BOSNIA_AND_HERZEGOVINA = 29, "Боснія і Герцеговина"
    BOTSWANA = 30, "Ботсвана"
    BRAZIL = 31, "Бразилія"
    BRITISH_INDIAN_OCEAN_TERRITORY = 32, "Британська територія в Індійському океані"
    BRITISH_VIRGIN_ISLANDS = 33, "Британські Віргінські острови"
    BRUNEI = 34, "Бруней"
    BURKINA_FASO = 35, "Буркіна-Фасо"
    BURUNDI = 36, "Бурунді"
    BHUTAN = 37, "Бутан"
    VANUATU = 38, "Вануату"
    VATICAN = 39, "Ватикан"
    UNITED_KINGDOM = 40, "Велика Британія"
    VENEZUELA = 41, "Венесуела"
    VIETNAM = 42, "В'єтнам"
    ARMENIA = 43, "Вірменія"
    WALLIS_AND_FUTUNA = 44, "Волліс і Футуна"
    GABON = 45, "Габон"
    HAITI = 46, "Гаїті"
    GAMBIA = 48, "Гамбія"
    GHANA = 49, "Гана"
    GUYANA = 47, "Гаяна"
    GUADELOUPE = 50, "Гваделупа"
    GUATEMALA = 51, "Гватемала"
    GUINEA = 52, "Гвінея"
    GUINEA_BISSAU = 53, "Гвінея-Бісау"
    GUERNSEY = 54, "Гернсі"
    GIBRALTAR = 61, "Гібралтар"
    HONDURAS = 55, "Гондурас"
    HONG_KONG = 56, "Гонконг"
    GRENADA = 57, "Гренада"
    GREECE = 58, "Греція"
    GEORGIA = 59, "Грузія"
    GUAM = 60, "Гуам"
    GREENLAND = 62, "Ґренландія"
    DENMARK = 63, "Данія"
    JERSEY = 65, "Джерсі"
    DJIBOUTI = 66, "Джибуті"
    DOMINICA = 67, "Домініка"
    DOMINICAN_REPUBLIC = 68, "Домініканська Республіка"
    DRC = 64, "ДР Конго"
    EGYPT = 75, "Єгипет"
    ECUADOR = 70, "Еквадор"
    EQUATORIAL_GUINEA = 71, "Екваторіальна Гвінея"
    YEMEN = 76, "Ємен"
    ERITREA = 72, "Еритрея"
    ESTONIA = 73, "Естонія"
    ETHIOPIA = 74, "Ефіопія"
    ZAMBIA = 77, "Замбія"
    WESTERN_SAHARA = 78, "Західна Сахара"
    ZIMBABWE = 79, "Зімбабве"
    US_MINOR_OUTLYING_ISLANDS = 69, "Зовнішні малі острови США"
    ISRAEL = 80, "Ізраїль"
    INDIA = 81, "Індія"
    INDONESIA = 82, "Індонезія"
    IRAQ = 83, "Ірак"
    IRAN = 84, "Іран"
    IRELAND = 85, "Ірландія"
    ICELAND = 86, "Ісландія"
    SPAIN = 87, "Іспанія"
    ITALY = 88, "Італія"
    JORDAN = 89, "Йорданія"
    CABO_VERDE = 90, "Кабо-Верде"
    KAZAKHSTAN = 91, "Казахстан"
    CAYMAN_ISLANDS = 92, "Кайманові острови"
    CAMBODIA = 93, "Камбоджа"
    CAMEROON = 94, "Камерун"
    CANADA = 95, "Канада"
    QATAR = 96, "Катар"
    KENYA = 97, "Кенія"
    KYRGYZSTAN = 98, "Киргизстан"
    CYPRUS = 101, "Кіпр"
    KIRIBATI = 102, "Кірибаті"
    CHINA = 99, "КНР"
    COCOS_ISLANDS = 103, "Кокосові острови (Кілінг)"
    COLOMBIA = 104, "Колумбія"
    COMOROS = 105, "Коморські Острови"
    CONGO = 106, "Конго"
    COSTA_RICA = 107, "Коста-Рика"
    COTE_DIVOIRE = 108, "Кот-д'Івуар"
    CUBA = 109, "Куба"
    KUWAIT = 110, "Кувейт"
    LAOS = 111, "Лаос"
    LATVIA = 112, "Латвія"
    LESOTHO = 113, "Лесото"
    LITHUANIA = 114, "Литва"
    LIBERIA = 115, "Ліберія"
    LEBANON = 116, "Ліван"
    LIBYA = 117, "Лівія"
    LIECHTENSTEIN = 118, "Ліхтенштейн"
    LUXEMBOURG = 119, "Люксембург"
    MAURITIUS = 120, "Маврикій"
    MAURITANIA = 121, "Мавританія"
    MADAGASCAR = 122, "Мадагаскар"
    MAYOTTE = 123, "Майотта"
    MACAO = 124, "Макао"
    MACEDONIA = 125, "Македонія"
    MALAWI = 126, "Малаві"
    MALAYSIA = 127, "Малайзія"
    MALDIVES = 129, "Мальдіви"
    MALI = 128, "Малі"
    MALTA = 130, "Мальта"
    MOROCCO = 131, "Марокко"
    MARTINIQUE = 132, "Мартиніка"
    MARSHALL_ISLANDS = 133, "Маршаллові Острови"
    MEXICO = 134, "Мексика"
    MOZAMBIQUE = 135, "Мозамбік"
    MOLDOVA = 136, "Молдова"
    MONACO = 137, "Монако"
    MONGOLIA = 138, "Монголія"
    MONTSERRAT = 139, "Монтсеррат"
    MYANMAR = 140, "М'янма"
    NAMIBIA = 141, "Намібія"
    NAURU = 142, "Науру"
    NEPAL = 143, "Непал"
    NIGER = 144, "Нігер"
    NIGERIA = 145, "Нігерія"
    NETHERLANDS = 146, "Нідерланди"
    NETHERLANDS_ANTILLES = 147, "Нідерландські Антильські острови"
    NICARAGUA = 148, "Нікарагуа"
    GERMANY = 149, "Німеччина"
    NIUE = 150, "Ніуе"
    NEW_ZEALAND = 151, "Нова Зеландія"
    NEW_CALEDONIA = 152, "Нова Каледонія"
    NORWAY = 153, "Норвегія"
    UAE = 154, "ОАЕ"
    OMAN = 155, "Оман"
    BOUVET_ISLAND = 156, "Острів Буве"
    ISLE_OF_MAN = 157, "Острів Мен"
    NORFOLK_ISLAND = 158, "Острів Норфолк"
    CHRISTMAS_ISLAND = 159, "Острів Різдва"
    HEARD_MACDONALD_ISLANDS = 161, "Острови Герд і Макдональд"
    COOK_ISLANDS = 162, "Острови Кука"
    SAINT_HELENA_TRISTAN_DA_CUNHA = 160, "Острови Святої Єлени, Вознесіння і Тристан-да-Кунья"
    TURKS_CAICOS_ISLANDS = 214, "Острови Теркс і Кайкос"
    PAKISTAN = 163, "Пакистан"
    PALAU = 164, "Палау"
    PALESTINE = 165, "Палестина"
    PANAMA = 166, "Панама"
    PAPUA_NEW_GUINEA = 167, "Папуа - Нова Гвінея"
    SOUTH_AFRICA = 173, "ПАР"
    PARAGUAY = 168, "Парагвай"
    PERU = 169, "Перу"
    SOUTH_GEORGIA_SANDWICH_ISLANDS = 170, "Південна Джорджія та Південні Сандвічеві острови"
    SOUTH_KOREA = 171, "Південна Корея"
    SOUTH_SUDAN = 172, "Південний Судан"
    NORTH_KOREA = 100, "Північна Корея"
    NORTHERN_MARIANA_ISLANDS = 174, "Північні Маріанські острови"
    PITCAIRN = 175, "Піткерн"
    POLAND = 176, "Польща"
    PORTUGAL = 177, "Португалія"
    PUERTO_RICO = 178, "Пуерто-Рико"
    REUNION = 179, "Реюньйон"
    RUSSIA = 180, "Росія"
    RWANDA = 181, "Руанда"
    ROMANIA = 182, "Румунія"
    EL_SALVADOR = 183, "Сальвадор"
    SAMOA = 184, "Самоа"
    SAN_MARINO = 185, "Сан-Марино"
    SAO_TOME_PRINCIPE = 186, "Сан-Томе і Принсіпі"
    SAUDI_ARABIA = 187, "Саудівська Аравія"
    ESWATINI = 188, "Свазіленд"
    SVALBARD_JAN_MAYEN = 189, "Свальбард і Ян-Маєн"
    SEYCHELLES = 190, "Сейшельські Острови"
    SAINT_BARTHELEMY = 191, "Сен-Бартельмі"
    SENEGAL = 192, "Сенегал"
    SAINT_MARTIN = 193, "Сен-Мартін"
    SAINT_PIERRE_MIQUELON = 194, "Сен-П'єр і Мікелон"
    SAINT_VINCENT_GRENADINES = 195, "Сент-Вінсент і Гренадини"
    SAINT_KITTS_NEVIS = 196, "Сент-Кіттс і Невіс"
    SAINT_LUCIA = 197, "Сент-Люсія"
    SERBIA = 198, "Сербія"
    SIERRA_LEONE = 209, "Сьєрра-Леоне"
    SYRIA = 199, "Сирія"
    SINGAPORE = 200, "Сінгапур"
    SLOVAKIA = 201, "Словаччина"
    SLOVENIA = 202, "Словенія"
    SOLOMON_ISLANDS = 203, "Соломонові Острови"
    SOMALIA = 204, "Сомалі"
    SUDAN = 206, "Судан"
    SURINAME = 207, "Суринам"
    EAST_TIMOR = 208, "Східний Тимор"
    USA = 205, "США"
    TAJIKISTAN = 210, "Таджикистан"
    THAILAND = 211, "Таїланд"
    TAIWAN = 212, "Тайвань"
    TANZANIA = 213, "Танзанія"
    TOGO = 215, "Того"
    TOKELAU = 216, "Токелау"
    TONGA = 217, "Тонга"
    TRINIDAD_AND_TOBAGO = 218, "Тринідад і Тобаго"
    TUVALU = 219, "Тувалу"
    TUNISIA = 220, "Туніс"
    TURKEY = 221, "Туреччина"
    TURKMENISTAN = 222, "Туркменістан"
    UGANDA = 223, "Уганда"
    HUNGARY = 224, "Угорщина"
    UZBEKISTAN = 225, "Узбекистан"
    URUGUAY = 227, "Уругвай"
    FAROE_ISLANDS = 228, "Фарерські острови"
    FEDERATED_STATES_MICRONESIA = 229, "Федеративні Штати Мікронезії"
    FIJI = 230, "Фіджі"
    PHILIPPINES = 231, "Філіппіни"
    FINLAND = 232, "Фінляндія"
    FALKLAND_ISLANDS = 233, "Фолклендські (Мальвінські) острови"
    FRANCE = 234, "Франція"
    FRENCH_GUIANA = 235, "Французька Гвіана"
    FRENCH_POLYNESIA = 236, "Французька Полінезія"
    FRENCH_SOUTHERN_TERRITORIES = 237, "Французькі Південні території"
    CROATIA = 238, "Хорватія"
    CENTRAL_AFRICAN_REPUBLIC = 239, "Центральноафриканська Республіка"
    CHAD = 240, "Чад"
    CZECH_REPUBLIC = 241, "Чехія"
    CHILE = 242, "Чилі"
    MONTENEGRO = 243, "Чорногорія"
    SWITZERLAND = 244, "Швейцарія"
    SWEDEN = 245, "Швеція"
    SRI_LANKA = 246, "Шрі-Ланка"
    JAMAICA = 247, "Ямайка"
    JAPAN = 248, "Японія"

class ResponsiblePositionType(models.TextChoices):
    NO_RESPONSIBLE_POSITION = ("Ні", "Ні")
    PRESIDENT_QUEEN_MINISTERS = (
        "Президент України, Прем’єр-міністр України, член Кабінету Міністрів України, перший заступник або заступник міністра",
        "Президент України, Прем’єр-міністр України, член Кабінету Міністрів України, перший заступник або заступник міністра"
    )
    PEOPLE_DEPUTY = (
        "Народний депутат України",
        "Народний депутат України"
    )
    NATIONAL_COUNCILS_MEMBER = (
        "Член Національної ради України з питань телебачення і радіомовлення, Національної комісії, що здійснює державне регулювання у сфері ринків фінансових послуг, Національної комісії з цінних паперів та фондового ринку, Антимонопольного комітету України",
        "Член Національної ради України з питань телебачення і радіомовлення, Національної комісії, що здійснює державне регулювання у сфері ринків фінансових послуг, Національної комісії з цінних паперів та фондового ринку, Антимонопольного комітету України"
    )
    COMPLAINTS_AUTHORITY = (
        "Уповноважений з розгляду скарг про порушення законодавства у сфері публічних закупівель",
        "Уповноважений з розгляду скарг про порушення законодавства у сфері публічних закупівель"
    )
    TV_HEAD = (
        "Голова Державного комітету телебачення і радіомовлення України",
        "Голова Державного комітету телебачення і радіомовлення України"
    )
    STATE_PROPERTY_HEAD = (
        "Голова фонду державного майна України, його перший заступник або заступник, член Центральної виборчої комісії",
        "Голова фонду державного майна України, його перший заступник або заступник, член Центральної виборчої комісії"
    )
    JUDGES_COUNCIL_MEMBER = (
        "Член, інспектор Вищої ради правосуддя, член, інспектор Вищої кваліфікаційної комісії суддів України",
        "Член, інспектор Вищої ради правосуддя, член, інспектор Вищої кваліфікаційної комісії суддів України"
    )
    HUMAN_RIGHTS_OMBUDSMAN = (
        "Уповноважений Верховної Ради України з прав людини",
        "Уповноважений Верховної Ради України з прав людини"
    )
    LANGUAGE_PROTECTION_OMBUDSMAN = (
        "Уповноважений із захисту державної мови, члени Національної комісії зі стандартів державної мови",
        "Уповноважений із захисту державної мови, члени Національної комісії зі стандартів державної мови"
    )
    NABU_DIRECTOR = (
        "Директор Національного антикорупційного бюро України, його перший заступник та заступник",
        "Директор Національного антикорупційного бюро України, його перший заступник та заступник"
    )
    NABU_HEAD = (
        "Голова Національного агентства з питань запобігання корупції та його заступники",
        "Голова Національного агентства з питань запобігання корупції та його заступники"
    )
    GENERAL_PROSECUTOR = (
        "Генеральний прокурор, його перший заступник та заступник",
        "Генеральний прокурор, його перший заступник та заступник"
    )
    NATIONAL_BANK_HEAD = (
        "Голова Національного банку України, його перший заступник та заступник, член Ради Національного банку України",
        "Голова Національного банку України, його перший заступник та заступник, член Ради Національного банку України"
    )
    NSDC_SECRETARY = (
        "Секретар Ради національної безпеки і оборони України, його перший заступник та заступник",
        "Секретар Ради національної безпеки і оборони України, його перший заступник та заступник"
    )
    PRESIDENT_OFFICE_HEAD = (
        "Керівник Офісу Президента України, його перший заступник та заступник",
        "Керівник Офісу Президента України, його перший заступник та заступник"
    )
    PRESIDENT_REPRESENTATIVE_CRIMEA = (
        "Постійний Представник Президента України в Автономній Республіці Крим, його перший заступник та заступник, радник або помічник Президента України, Прем’єр-міністра України",
        "Постійний Представник Президента України в Автономній Республіці Крим, його перший заступник та заступник, радник або помічник Президента України, Прем’єр-міністра України"
    )
    STATE_SERVICE_A_B_CATEGORY = (
        "Особи, посади яких належать до посад державної служби категорії 'А' або 'Б'",
        "Особи, посади яких належать до посад державної служби категорії 'А' або 'Б'"
    )
    LOCAL_GOV_CATEGORY_1_3 = (
        "Особи, посади яких частиною першою статті 14 Закону України 'Про службу в органах місцевого самоврядування' віднесені до першої - третьої категорій",
        "Особи, посади яких частиною першою статті 14 Закону України 'Про службу в органах місцевого самоврядування' віднесені до першої - третьої категорій"
    )
    JUDGES = (
        "Судді, судді Конституційного Суду України",
        "Судді, судді Конституційного Суду України"
    )
    PROSECUTOR = (
        "Прокурор, слідчий, дізнавач",
        "Прокурор, слідчий, дізнавач"
    )
    STATE_ORG_HEAD = (
        "Керівник, заступник керівника державного органу, юрисдикція якого поширюється на всю територію України, їх апаратів та самостійних структурних підрозділів",
        "Керівник, заступник керівника державного органу, юрисдикція якого поширюється на всю територію України, їх апаратів та самостійних структурних підрозділів"
    )
    REGIONAL_ORG_HEAD = (
        "Керівник, заступник керівника державного органу, органу влади Автономної Республіки Крим, юрисдикція яких поширюється на територію однієї або кількох областей, Автономної Республіки Крим, міст Києва або Севастополя",
        "Керівник, заступник керівника державного органу, органу влади Автономної Республіки Крим, юрисдикція яких поширюється на територію однієї або кількох областей, Автономної Республіки Крим, міст Києва або Севастополя"
    )
    LOCAL_ORG_HEAD = (
        "Керівник державного органу, органу влади Автономної Республіки Крим, юрисдикція якого поширюється на територію одного або кількох районів, міста республіканського в Автономній Республіці Крим або обласного значення, району в місті, міста районного значення",
        "Керівник державного органу, органу влади Автономної Республіки Крим, юрисдикція якого поширюється на територію одного або кількох районів, міста республіканського в Автономній Республіці Крим або обласного значення, району в місті, міста районного значення"
    )
    MILITARY_OFFICER = (
        "Військова посадова особа вищого офіцерського складу",
        "Військова посадова особа вищого офіцерського складу"
    )
    NATIONAL_COMMISSIONS_MEMBER = (
        "Член Національної комісії, що здійснює державне регулювання у сферах електронних комунікацій, радіочастотного спектра та надання послуг поштового зв’язку",
        "Член Національної комісії, що здійснює державне регулювання у сферах електронних комунікацій, радіочастотного спектра та надання послуг поштового зв’язку"
    )
    ACCOUNTS_CHAMBER_HEAD = (
        "Голова та інші члени Рахункової палати, Секретар Рахункової палати та його заступник",
        "Голова та інші члени Рахункової палати, Секретар Рахункової палати та його заступник"
    )

class CorruptionAffectedType(models.TextChoices):
    NO_CORRUPTION_AFFECTED = ("Ні", "Ні")
    HEAD_OF_VR_SECRETARIAT = (
        "Керівник секретаріату Верховної Ради України та його заступник (за умови належності такої посади до патронатної служби та виконання організаційно-розпорядчих чи адміністративно-господарських функцій)",
        "Керівник секретаріату Верховної Ради України та його заступник (за умови належності такої посади до патронатної служби та виконання організаційно-розпорядчих чи адміністративно-господарських функцій)"
    )
    PRESIDENT_OFFICE_EMPLOYEE = (
        "Працівник Офісу Президента України (окрім посади, яка зазначена у примітці до ст. 51-3 Закону України «Про запобігання корупції»)",
        "Працівник Офісу Президента України (окрім посади, яка зазначена у примітці до ст. 51-3 Закону України «Про запобігання корупції»)"
    )
    AUDIT_CHAMBER_MEMBER = (
        "Член Рахункової палати або іншого державного колегіального органу (окрім посади, яка зазначена у примітці до ст. 51-3 Закону України «Про запобігання корупції»)",
        "Член Рахункової палати або іншого державного колегіального органу (окрім посади, яка зазначена у примітці до ст. 51-3 Закону України «Про запобігання корупції»)"
    )
    NABU_STRUCTURAL_HEAD = (
        "Керівник та заступник керівника структурного підрозділу у складі самостійного структурного підрозділу центрального апарату Національного банку України",
        "Керівник та заступник керівника структурного підрозділу у складі самостійного структурного підрозділу центрального апарату Національного банку України"
    )
    STATE_ORG_HEAD = (
        "Керівник та заступник керівника державного підприємства, установи, організації, іншого суб’єкта господарювання, призначення якого (укладення контракту з яким) здійснює державний орган",
        "Керівник та заступник керівника державного підприємства, установи, організації, іншого суб’єкта господарювання, призначення якого (укладення контракту з яким) здійснює державний орган"
    )
    URBAN_PLANNING_HEAD = (
        "Керівник підприємства (за умови призначення (укладення контракту) міським головою міст Києва та Севастополя), яке здійснює діяльність у галузі містобудування, житлово-комунального господарства",
        "Керівник підприємства (за умови призначення (укладення контракту) міським головою міст Києва та Севастополя), яке здійснює діяльність у галузі містобудування, житлово-комунального господарства"
    )
    LAND_PROTECTION_HEAD = (
        "Керівник підприємства (за умови призначення (укладення контракту) міським головою міст Києва та Севастополя), яке здійснює діяльність у галузі використання та охорони земель, природних ресурсів і охорони довкілля",
        "Керівник підприємства (за умови призначення (укладення контракту) міським головою міст Києва та Севастополя), яке здійснює діяльність у галузі використання та охорони земель, природних ресурсів і охорони довкілля"
    )
    SOCIO_ECONOMIC_HEAD = (
        "Керівник підприємства (за умови призначення (укладення контракту) міським головою міст Києва та Севастополя), яке здійснює діяльність у галузі соціально-економічного розвитку, транспорту та дорожнього господарства",
        "Керівник підприємства (за умови призначення (укладення контракту) міським головою міст Києва та Севастополя), яке здійснює діяльність у галузі соціально-економічного розвитку, транспорту та дорожнього господарства"
    )
    PROPERTY_MANAGEMENT_HEAD = (
        "Керівник підприємства (за умови призначення (укладення контракту) міським головою міст Києва та Севастополя), яке здійснює діяльність у галузі управління майном, торгівлі та розвитку підприємництва",
        "Керівник підприємства (за умови призначення (укладення контракту) міським головою міст Києва та Севастополя), яке здійснює діяльність у галузі управління майном, торгівлі та розвитку підприємництва"
    )
    STATE_OFFICIAL_B_CATEGORY = (
        "Державний службовець категорії «В» (за умови підпорядкування безпосередньо керівнику або заступнику керівника державного органу, здійснення повноважень з поширенням на всю територію України)",
        "Державний службовець категорії «В» (за умови підпорядкування безпосередньо керівнику або заступнику керівника державного органу, здійснення повноважень з поширенням на всю територію України)"
    )
    SUPERVISORY_BOARD_MEMBER = (
        "Член наглядової ради державного підприємства / холдингу, комунального об’єднання (частка держави у статутному капіталі становить 50% і більше)",
        "Член наглядової ради державного підприємства / холдингу, комунального об’єднання (частка держави у статутному капіталі становить 50% і більше)"
    )
    COMMISSION_CHAIR_HEAD = (
        "Голова постійної комісії (у сфері бюджету, буд-ва, земельних відносин та комунальної власності) обласної / районної ради, Київській та Севастопольській міських радах",
        "Голова постійної комісії (у сфері бюджету, буд-ва, земельних відносин та комунальної власності) обласної / районної ради, Київській та Севастопольській міських радах"
    )
    LOCAL_GOVERNOR = (
        "Міський (міста районного значення) голова, селищний і сільський голова",
        "Міський (міста районного значення) голова, селищний і сільський голова"
    )
    DEPUTY_HEAD_LOCAL_ADMIN = (
        "Заступник голови місцевої державної адміністрації (окрім посади, яка зазначена у примітці до ст. 51-3 Закону України «Про запобігання корупції»)",
        "Заступник голови місцевої державної адміністрації (окрім посади, яка зазначена у примітці до ст. 51-3 Закону України «Про запобігання корупції»)"
    )
    CRIMEA_TCK_HEAD = (
        "Керівник, заступник керівника ТЦК та СП АР Крим, області, м. Києва та м. Севастополя та керівник районного (об’єднаного районного) ТЦК та СП",
        "Керівник, заступник керівника ТЦК та СП АР Крим, області, м. Києва та м. Севастополя та керівник районного (об’єднаного районного) ТЦК та СП"
    )

class PublicPersonType(models.TextChoices):
    NO_PUBLIC_PERSON = ("Ні", "Ні")
    PRESIDENT_AND_CABINET = (
        "Президент України, Прем’єр-міністр України, члени Кабінету Міністрів України та їх заступники",
        "Президент України, Прем’єр-міністр України, члени Кабінету Міністрів України та їх заступники"
    )
    PRESIDENT_AUXILIARY_ORG_HEAD = (
        "Керівник постійно діючого допоміжного органу, утвореного Президентом України, його заступники",
        "Керівник постійно діючого допоміжного органу, утвореного Президентом України, його заступники"
    )
    HEAD_OF_STATE_ADMIN = (
        "Керівник та заступники керівника Державного управління справами",
        "Керівник та заступники керівника Державного управління справами"
    )
    HEADS_OF_STATE_ORGANIZATIONS = (
        "Керівники апаратів (секретаріатів) державних органів, що не є державними службовцями, посади яких належать до категорії 'А'",
        "Керівники апаратів (секретаріатів) державних органів, що не є державними службовцями, посади яких належать до категорії 'А'"
    )
    SECURITY_COUNCIL_SECRETARY = (
        "Секретар та заступники Секретаря Ради національної безпеки і оборони України",
        "Секретар та заступники Секретаря Ради національної безпеки і оборони України"
    )
    PEOPLE_DEPUTY = (
        "Народні депутати України",
        "Народні депутати України"
    )
    NATIONAL_BANK_HEAD = (
        "Голова та члени Правління Національного банку України, члени Ради Національного банку України",
        "Голова та члени Правління Національного банку України, члени Ради Національного банку України"
    )
    JUDGES = (
        "Голови та судді Конституційного Суду України, Верховного Суду, вищих спеціалізованих судів",
        "Голови та судді Конституційного Суду України, Верховного Суду, вищих спеціалізованих судів"
    )
    HIGH_JUDICIAL_COUNCIL_MEMBERS = (
        "Члени Вищої ради правосуддя, члени Вищої кваліфікаційної комісії суддів України, члени Кваліфікаційно-дисциплінарної комісії прокурорів",
        "Члени Вищої ради правосуддя, члени Вищої кваліфікаційної комісії суддів України, члени Кваліфікаційно-дисциплінарної комісії прокурорів"
    )
    GENERAL_PROSECUTOR_AND_DEPUTIES = (
        "Генеральний прокурор та його заступники",
        "Генеральний прокурор та його заступники"
    )
    SBU_HEAD_AND_DEPUTIES = (
        "Голова Служби безпеки України та його заступники",
        "Голова Служби безпеки України та його заступники"
    )
    NABU_HEAD_AND_DEPUTIES = (
        "Директор Національного антикорупційного бюро України та його заступники",
        "Директор Національного антикорупційного бюро України та його заступники"
    )
    DCI_HEAD_AND_DEPUTIES = (
        "Директор Державного бюро розслідувань та його заступники",
        "Директор Державного бюро розслідувань та його заступники"
    )
    BEB_HEAD_AND_DEPUTIES = (
        "Директор Бюро економічної безпеки України та його заступники",
        "Директор Бюро економічної безпеки України та його заступники"
    )
    NRT_HEAD_AND_MEMBERS = (
        "Голова та члени Національної ради України з питань телебачення і радіомовлення, Голова та члени Антимонопольного комітету України",
        "Голова та члени Національної ради України з питань телебачення і радіомовлення, Голова та члени Антимонопольного комітету України"
    )
    NAPK_HEAD_DEPUTIES = (
        "Голова Національного агентства з питань запобігання корупції та його заступники, Голова та члени Рахункової палати, Голова та члени Центральної виборчої комісії, голови та члени інших державних колегіальних органів",
        "Голова Національного агентства з питань запобігання корупції та його заступники, Голова та члени Рахункової палати, Голова та члени Центральної виборчої комісії, голови та члени інших державних колегіальних органів"
    )
    AMBASSADORS = (
        "Надзвичайні і повноважні посли",
        "Надзвичайні і повноважні посли"
    )
    CHIEF_OF_GENERAL_STAFF = (
        "Начальник Генерального штабу - Головнокомандувач Збройних Сил України, командувачі Сухопутних військ Збройних Сил України, Повітряних Сил Збройних Сил України, Військово-Морських Сил Збройних Сил України",
        "Начальник Генерального штабу - Головнокомандувач Збройних Сил України, командувачі Сухопутних військ Збройних Сил України, Повітряних Сил Збройних Сил України, Військово-Морських Сил Збройних Сил України"
    )
    CATEGORY_A_SERVICE = (
        "Державні службовці, посади яких належать до категорії 'А'",
        "Державні службовці, посади яких належать до категорії 'А'"
    )
    PROSECUTION_HEADS = (
        "Керівники органів прокуратури, керівники обласних територіальних органів Служби безпеки України, голови та судді апеляційних судів",
        "Керівники органів прокуратури, керівники обласних територіальних органів Служби безпеки України, голови та судді апеляційних судів"
    )
    ADMIN_OR_SUPERVISORY_HEADS = (
        "Керівники адміністративних, управлінських чи наглядових органів державних та казенних підприємств, господарських товариств, державна частка у статутному капіталі яких прямо чи опосередковано перевищує 50 відсотків",
        "Керівники адміністративних, управлінських чи наглядових органів державних та казенних підприємств, господарських товариств, державна частка у статутному капіталі яких прямо чи опосередковано перевищує 50 відсотків"
    )
    POLITICAL_PARTY_LEADERS = (
        "Члени керівних органів політичних партій",
        "Члени керівних органів політичних партій"
    )

class Declarant(models.Model):
    # Id
    user_declarant_id = models.PositiveBigIntegerField(null=True, blank=True)
    api_id = models.UUIDField(null=True, blank=True)
    # Звичайні поля
    surname = models.CharField(max_length=100)
    name = models.CharField(max_length=100)
    patronymic = models.CharField(max_length=100, null=True, blank=True)
    work_place = models.CharField(max_length=255, null=True, blank=True)
    work_post = models.CharField(max_length=255, null=True, blank=True)
    responsible_position = models.CharField(choices=ResponsiblePositionType.choices, max_length=550, null=True, blank=True)
    corruption_affected = models.CharField(choices=CorruptionAffectedType.choices, max_length=550, null=True, blank=True)
    public_person = models.CharField(choices=PublicPersonType.choices, max_length=550, null=True, blank=True)
    actual_country = models.PositiveSmallIntegerField(choices=CountryDeclarant.choices, null=True, blank=True)
    region = models.CharField(max_length=255, null=True, blank=True)
    # Зв'язки
    owner = models.OneToOneField("Owner", on_delete=models.CASCADE, related_name="declarant", null=True, blank=True)
    # Метадані
    created_at = models.DateTimeField(auto_now_add=True)
    updated_at = models.DateTimeField(auto_now=True)

    def __str__(self):
        parts = [
            f"Декларант: {self.surname or ''} {self.name or ''} {self.patronymic or ''}".strip(),
            f"Посада: {self.work_post or 'не вказано'}",
            f"Місце роботи: {self.work_place or 'не вказано'}",
            f"Країна: {self.get_actual_country_display() if hasattr(self, 'get_actual_country_display') and self.actual_country else 'не вказано'}",
            f"Регіон: {self.region or 'не вказано'}",
            f"Займає таке відповідальне та особливо відповідальне становище: {self.get_responsible_position_display() if hasattr(self, 'get_responsible_position_display') and self.responsible_position else 'не вказано'}",
            f"Посада, пов'язана з високим рівнем корупційних ризиків: {self.get_corruption_affected_display() if hasattr(self, 'get_corruption_affected_display') and self.corruption_affected else 'не вказано'}",
            f"Відноситься до національних публічних діячів: {self.get_public_person_display() if hasattr(self, 'get_public_person_display') and self.public_person else 'Ні'}"
        ]
        return "\n".join(parts)